; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   brown_block_1 brown_block_2 green_block_1 black_block_1 black_block_2 black_block_3 grey_block_1 - block
 )
 (:init (ontable brown_block_1) (ontable brown_block_2) (on green_block_1 brown_block_2) (ontable black_block_1) (on black_block_2 black_block_1) (on black_block_3 brown_block_1) (on grey_block_1 green_block_1) (clear black_block_2) (clear black_block_3) (clear grey_block_1) (handempty) (= (total-cost) 0))
 (:goal (and (holding black_block_3)))
 (:constraints (sometime (not (on black_block_3 brown_block_1))) (sometime-before (not (on black_block_3 brown_block_1)) (holding brown_block_2)) (sometime (not (on green_block_1 green_block_1))) (sometime-after (not (on green_block_1 green_block_1)) (or (holding black_block_1) (on green_block_1 black_block_1))) (sometime (or (clear green_block_1) (on brown_block_1 black_block_1))) (sometime (not (on black_block_3 black_block_1))) (sometime-after (not (on black_block_3 black_block_1)) (or (not (ontable brown_block_2)) (not (clear brown_block_1)))) (sometime (clear brown_block_1)) (sometime-before (clear brown_block_1) (on black_block_2 green_block_1)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack grey_block_1 green_block_1)
   deleted: (on grey_block_1 green_block_1) (clear grey_block_1) (handempty)
   added: (holding grey_block_1) (clear green_block_1)
   goals met: 0 of 1
2. (putdown grey_block_1)
   deleted: (holding grey_block_1)
   added: (clear grey_block_1) (handempty) (ontable grey_block_1)
   goals met: 0 of 1
3. (unstack black_block_2 black_block_1)
   deleted: (on black_block_2 black_block_1) (clear black_block_2) (handempty)
   added: (holding black_block_2) (clear black_block_1)
   goals met: 0 of 1
4. (putdown black_block_2)
   deleted: (holding black_block_2)
   added: (clear black_block_2) (handempty) (ontable black_block_2)
   goals met: 0 of 1
5. (unstack green_block_1 brown_block_2)
   deleted: (on green_block_1 brown_block_2) (clear green_block_1) (handempty)
   added: (holding green_block_1) (clear brown_block_2)
   goals met: 0 of 1
6. (stack green_block_1 black_block_1)
   deleted: (clear black_block_1) (holding green_block_1)
   added: (handempty) (clear green_block_1) (on green_block_1 black_block_1)
   goals met: 0 of 1
7. (pickup brown_block_2)
   deleted: (clear brown_block_2) (ontable brown_block_2) (handempty)
   added: (holding brown_block_2)
   goals met: 0 of 1
8. (stack brown_block_2 grey_block_1)
   deleted: (clear grey_block_1) (holding brown_block_2)
   added: (handempty) (clear brown_block_2) (on brown_block_2 grey_block_1)
   goals met: 0 of 1
9. (pickup black_block_2)
   deleted: (clear black_block_2) (ontable black_block_2) (handempty)
   added: (holding black_block_2)
   goals met: 0 of 1
10. (stack black_block_2 green_block_1)
   deleted: (clear green_block_1) (holding black_block_2)
   added: (handempty) (clear black_block_2) (on black_block_2 green_block_1)
   goals met: 0 of 1
11. (unstack black_block_3 brown_block_1)
   deleted: (on black_block_3 brown_block_1) (clear black_block_3) (handempty)
   added: (holding black_block_3) (clear brown_block_1)
   goals met: 1 of 1
